{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "6"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_96", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_97", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/unstack-folded-0"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_98", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_99", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/unstack-folded-1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_91", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack-folded-0"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack-folded-1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_89", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/encoder/gru/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_107", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_96", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_143"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_108", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_97", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_144"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_109", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_98", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_145"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_110", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_99", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_146"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_102", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_91", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_138"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_83"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_84"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_85"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_78"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_100", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_89", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_136"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder/gru/Shape", "StatefulPartitionedCall/encoder/gru/strided_slice/stack", "StatefulPartitionedCall/encoder/gru/strided_slice/stack_1", "StatefulPartitionedCall/encoder/gru/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose", "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/encoder/gru/strided_slice", "StatefulPartitionedCall/encoder/gru/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/Shape", "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/encoder/gru/zeros/packed", "StatefulPartitionedCall/encoder/gru/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/zeros"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2_1"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnUvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_81"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/cond/_27/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_45", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_40"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51", "op": "LoopCond", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/cond/_27/while/Less"]}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_11_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_10_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_12_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/time_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_counter_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2_1_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63", "op": "Identity", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_counter_switch/_52:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/exit/_67", "op": "Exit", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2_1_switch/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/sub/x", "op": "Const", "input": ["^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_58:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_11_switch/_59:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack_switch/_60:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split_1/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_85", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_12_switch/_61:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_10_switch/_56:1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_12_switch/_61:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack_switch/_62:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/input/_163", "op": "Identity", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/time_switch/_54:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_4/y", "op": "Const", "input": ["^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_5/y", "op": "Const", "input": ["^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/strided_slice_switch/_57:1", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/exit/_67", "StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/MatMul_1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack_switch/_62:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_58:1", "Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/input/_163", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_4", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/input/_163", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_4/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_counter_switch/_52:1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_5/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split_1", "op": "Split", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split_1/split_dim", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "3"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_11_switch/_59:1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/StatefulPartitionedCall/encoder/gru/PartitionedCall/unstack_switch/_60:1"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_4", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_5", "^StatefulPartitionedCall/encoder/gru/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_95", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/transpose_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/Shape", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split", "op": "Split", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split/split_dim", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "3"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_106", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_95", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_142"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/encoder/gru_1/Shape", "StatefulPartitionedCall/encoder/gru_1/strided_slice/stack", "StatefulPartitionedCall/encoder/gru_1/strided_slice/stack_1", "StatefulPartitionedCall/encoder/gru_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_94", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split:1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/encoder/gru_1/strided_slice", "StatefulPartitionedCall/encoder/gru_1/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_92", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_105", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_94", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_141"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/encoder/gru_1/zeros/packed", "StatefulPartitionedCall/encoder/gru_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_103", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_92", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_139"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/cond/_87/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_102", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_105", "^StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_100"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/Sigmoid", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru/PartitionedCall/input/_10_switch/_56:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/sub", "op": "Sub", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/sub/x", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/Sigmoid_1", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_93", "op": "Enter", "input": ["StatefulPartitionedCall/encoder/gru_1/zeros"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZW5jb2Rlci9ncnVfMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111", "op": "LoopCond", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/cond/_87/while/Less"]}, {"name": "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/split:2", "StatefulPartitionedCall/encoder/gru/PartitionedCall/while/body/_28/while/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_104", "op": "Merge", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/enter/_93", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/next_iteration/_140"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_118", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_106", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/input/_20_switch/_119", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_107", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/unstack_switch/_120", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_108", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/Func/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/input/_21_switch/_121", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_109", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/unstack_switch/_122", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_110", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/time_switch/_114", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_102", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/loop_counter_switch/_112", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_100", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/StatefulPartitionedCall/encoder/gru_1/PartitionedCall/TensorArrayV2_1_switch/_115", "op": "Switch", "input": ["StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/merge/_103", "StatefulPartitionedCall/encoder/gru_1/PartitionedCall/while/LoopCond/_111"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": 