{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "3"}]}}, "input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "output_2": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack-folded-0"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack-folded-1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["input_2"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_77"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_78"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_80"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_72"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_23", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_70"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/transpose", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/Shape", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZGVjb2Rlci9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_75"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/enter/_26", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_73"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/cond/_21/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_39", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45", "op": "LoopCond", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/cond/_21/while/Less"]}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_14_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_15_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/time_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_counter_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_34", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_13_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/LoopCond/_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/exit/_61", "op": "Exit", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1_switch/_49"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_counter_switch/_46:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/exit/_62", "op": "Exit", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_13_switch/_50"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/exit/_61", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/sub/x", "op": "Const", "input": ["^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_52:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_14_switch/_53:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack_switch/_54:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_15_switch/_55:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack_switch/_56:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/input/_97", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/time_switch/_48:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_4/y", "op": "Const", "input": ["^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_5/y", "op": "Const", "input": ["^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_switch/_51:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_13_switch/_50:1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_15_switch/_55:1", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/exit/_62"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_52:1", "Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/input/_97", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_4", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/input/_97", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_4/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_counter_switch/_46:1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_5/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/MatMul_1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack_switch/_56:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/decoder/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_14_switch/_53:1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack_switch/_54:1"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_4", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_70", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_5", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1", "op": "Split", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1/split_dim", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "3"}}}, {"name": "StatefulPartitionedCall/decoder/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/decoder/dense/BiasAdd", "StatefulPartitionedCall/decoder/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split", "op": "Split", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split/split_dim", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/BiasAdd"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split:1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/sub", "op": "Sub", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/sub/x", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Sigmoid", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/input/_13_switch/_50:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Sigmoid_1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split:2", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/sub", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/mul_1", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1_switch/_49:1", "Func/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/input/_97", "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_3"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_3", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_body_control/_57"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/dense/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/dense/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/dense_1/MatMul/ReadVariableOp", "shape": [32, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/dense_1/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/Read/ReadVariableOp", "shape": [3, 192], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack-folded-0", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/Read_1/ReadVariableOp", "shape": [64, 192], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/decoder/gru_2/PartitionedCall/unstack-folded-1", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/sub/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/split_1/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_4/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/gru_2/PartitionedCall/while/body/_22/while/add_5/y", "shape": [], "dtype": "int32"}]}]}